IlleniumDillon/MM32F5277/PinMap/MM32_ADC_PinMap.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2023-03-05 19:44:57
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2023-03-05 20:10:32
 * @FilePath: \buildd:\ARMFPGA\MM32F5277_Keil\PinMap\MM32_ADC_PinMap.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
 
#ifndef _MM32_ADC_PINMAP_H_
#define _MM32_ADC_PINMAP_H_

#include <MM32_PinMapType.h>

extern MM32_ADC_Pin ADC1_IN18_PF6;
extern MM32_ADC_Pin ADC1_IN17_PF7;
extern MM32_ADC_Pin ADC1_IN16_PF8;
extern MM32_ADC_Pin ADC1_IN15_PF9;
extern MM32_ADC_Pin ADC1_IN14_PF10;
extern MM32_ADC_Pin ADC1_IN10_PC0;
extern MM32_ADC_Pin ADC1_IN11_PC1;
extern MM32_ADC_Pin ADC1_IN12_PC2;
extern MM32_ADC_Pin ADC1_IN13_PC3;
extern MM32_ADC_Pin ADC1_IN0_PA0;
extern MM32_ADC_Pin ADC1_IN1_PA1;
extern MM32_ADC_Pin ADC1_IN2_PA2;
extern MM32_ADC_Pin ADC1_IN3_PA3;
extern MM32_ADC_Pin ADC1_IN4_PA4;
extern MM32_ADC_Pin ADC1_IN5_PA5;
extern MM32_ADC_Pin ADC1_IN6_PA6;
extern MM32_ADC_Pin ADC1_IN7_PA7;
extern MM32_ADC_Pin ADC1_IN8_PB0;
extern MM32_ADC_Pin ADC1_IN9_PB1;


extern MM32_ADC_Pin ADC2_IN10_PC0;
extern MM32_ADC_Pin ADC2_IN11_PC1;
extern MM32_ADC_Pin ADC2_IN0_PA0;
extern MM32_ADC_Pin ADC2_IN1_PA1;
extern MM32_ADC_Pin ADC2_IN2_PA2;
extern MM32_ADC_Pin ADC2_IN3_PA3;
extern MM32_ADC_Pin ADC2_IN4_PA4;
extern MM32_ADC_Pin ADC2_IN5_PA5;
extern MM32_ADC_Pin ADC2_IN6_PA6;
extern MM32_ADC_Pin ADC2_IN7_PA7;
extern MM32_ADC_Pin ADC2_IN14_PC4;
extern MM32_ADC_Pin ADC2_IN15_PC5;
extern MM32_ADC_Pin ADC2_IN8_PB0;
extern MM32_ADC_Pin ADC2_IN9_PB1;
extern MM32_ADC_Pin ADC2_IN12_PE7;
extern MM32_ADC_Pin ADC2_IN13_PE8;
extern MM32_ADC_Pin ADC2_IN16_PE9;

#endif